import type { GetServerSideProps } from "next";

//Components
import Layout from "@/Layout";
import Container from "@/Components/Common/Container";

//Urql
import { initUrqlClient } from "@/Urql/client";
import { GET_SETTINGS } from "@/Urql/Query/Settings/settings.query";
import { GET_RUNNING_FLASH } from "@/Urql/Query/Flash/flash.query";
import { GET_PROFILE } from "@/Urql/Query/Account/profile.query";

const PreOrder = () => {
    return (
        <Layout>
            <Container className="py-8">
                <p className="text-[15px]">
                    আমাদের ওয়েবসাইট ভিজিট এবং/অথবা আমাদের কাছ থেকে কোন প্রোডাক্ট ক্রয় করার মাধ্যমে আপনি আমাদের ওয়েবসাইটের একজন ইউজার হলেন এবং আমাদের সার্ভিসের সাথে সংযুক্ত হলেন এবং আমাদের “Terms of Service”, “Terms of use” অথবা “Terms” এর সাথে সম্মতি পোষন করলেন। এই টার্মস এবং কন্ডিশন গুলো সকল ওয়েবসাইট ইউজার, যারা ব্রাউজ করছেন, ভেন্ডর, কাস্টমার, মার্চেন্টস, এফিলিয়েট প্রোগ্রামার এবং/অথবা কন্টেন্ট কন্ট্রিবিউটরদের জন্য প্রযোজ্য।
                </p>
                <br />
                <h4 className="text-lg font-bold">সেকশন ১ - সাধারন কন্ডিশনঃ প্রোডাক্ট প্রাইস এবং প্রোডাক্ট স্টক</h4>
                <br />
                <p className="text-[15px]">
                    প্রোডাক্ট এর প্রাইস এবং প্রোডাক্ট টি এভেইলেবল আছে কি না সেটা পুরোপুরি নির্ভর করে প্রোডাক্ট এর স্টক এর ওপর। যদি কোন প্রোডাক্ট বা সার্ভিস এভেইলেবল না থাকে তাহলে NEKMART.COM যত দ্রুত সম্ভব আপনাকে জানাবে এবং সিমিলার বা অলটারনেটিভ প্রোডাক্ট সাজেস্ট করবে অথবা এডভান্স পেমেন্ট করা থাকলে সেটা রিফান্ড পলিসি অনুযায়ী রিফান্ড করবে। আমাদের রিফান্ড পলিসি সম্পর্কে বিস্তারিত জানতে রিফান্ড পলিসি সেকশন দেখে নিতে পারেন।
                </p>
                <br />
                <h4 className="text-lg font-bold">সেকশন ২ - বিলিং এবং একাউন্ট ইনফরমেশন সঠিক দেয়া</h4>
                <br />
                <p>
                    আমাদের কাছে প্লেস করা আপনার যেকোন অর্ডার আমরা প্রত্যাখ্যান করা, যেকোন অর্ডার, প্রি-অর্ডার এ প্রোডাক্ট সংখ্যা সীমিত বা ক্যান্সেল করার অধিকার রাখি। এই বাধ্যবাধকতাটি সেইম একাউন্ট, সেইম বিলিং এড্রেস, সেইম পেমেন্ট একাউন্ট, এবং/অথবা সেইম শিপিং এড্রেস হলেও কার্যকর হতে পারে। যেকোন অর্ডার ক্যান্সেল, প্রোডাক্ট পরিমান সীমিতকরণ, প্রোডাক্ট পরিমান ক্যান্সেল করার ক্ষেত্রে আমরা প্লেস করা অর্ডার ইনফরমেশনে থাকা কন্টাক্ট নাম্বার অথবা মেইল এড্রেস এর মাধ্যমে কাস্টমারের সাথে যোগাযোগ করার সর্বাত্মক চেষ্টা করবো। কোন স্পেশাল অফারের ক্ষেত্রে, আমাদের জাজমেন্টের মাধ্যমে আমরা যদি মনে করি যে, কোন ডিলার, ডিস্ট্রিবিউটর বা রিসেলার অর্ডার করেছেন, সেই অর্ডার ক্যান্সেল করার ও অধিকার রাখি আমরা।
                </p>
                <br />
                <h4 className="text-lg font-bold">সেকশন৩ - ডিসকাউন্ট</h4>
                <br />
                <p className="text-[15px]">
                    কুপন কোড, ডিস্কাউন্ট অফার, বা সাইনআপ অফার মুলত প্রোডাক্ট এর সাধারন প্রাইস কে কমিয়ে দেয়। ডিসকাউন্ট কুপন, গিফট কার্ড এর অর্ডার সাকসেস হবার পর সেটা আর রিফান্ড, রিটার্ন অথবা এক্সেঞ্জ হবেনা
                </p>
                <br />
                <h4 className="text-lg font-bold">সেকশন ৪ - ভুল ইনফরমেশন</h4>
                <br />
                <p className="text-[15px]">অনাকাঙ্ক্ষিতভাবে আমাদের ওয়েবসাইটে এমন কিছু প্রোডাক্ট বা সার্ভিস সম্পর্কে ভুল তথ্য থাকতে পারে। যেমন, টাইপিং ভুল, ভুল ইনফরমেশন অথবা ত্রুটি, যা যেকোন প্রোডাক্ট এর বিস্তারিত, মূল্য, প্রমোশন, অফার বা প্রোডাক্ট ডেলিভারি চার্জ কিংবা প্রোডাক্ট স্টক সম্পর্কে হতে পারে। তাই পূর্ব ঘোষনা ছাড়াই এধরনের ভুল ইনফরেশন কারেক্ট করার বা প্রয়োজনে পরিবর্তন করার অধিকার আমাদের রয়েছে। ভুলে কোন প্রোডাক্ট এর দাম অস্বাভাবিকভাবে কমে গেলে এবং সেই প্রোডাক্ট এর অর্ডার করলেও সেই অর্ডার ক্যান্সেল করা হতে পারে। যেমন ১২০০ টাকার প্রোডাক্টের প্রাইস যদি ভুলে ১২.০০ হয়ে যায় এমন ক্ষেত্রে পেমেন্ট করা অর্ডারও ক্যান্সেল করে রিফান্ড করা হতে পারে।</p>
                <br />
                <h4 className="text-lg font-bold">সেকশন ৫ - নিষিদ্ধ ব্যবহার</h4>
                <br />
                <p className="text-[15px]">
                    যেসব কারনে আমাদের ওয়েবসাইট ব্যাবহারে নিষেধাজ্ঞা রয়েছে, নিম্নে তা বর্ননা করা হলো।
                </p>
                <br />
                <ul className="text-[15px]">
                    <li>(ক) অনৈতিক কাজে ব্যাবহার করা।</li>
                    <li>(খ) অনৈতিক কাজে কাউকে প্ররোচিত করার জন্য ব্যাবহার করা।</li>
                    <li>(গ) যেকোন আন্তর্জাতিক, ফেডারেল, প্রাদেশিক বা জাতীয় প্রবিধান, রুলস, আইন, অথবা স্থানীয় নিয়ম অমান্য করার জন্য ব্যাবহার করা।</li>
                    <li>(ঘ) আমাদের বা অন্য কারো মেধা শক্তির অধিকার লঙ্ঘন করার জন্য ব্যাবহার করা।</li>
                    <li>(ঙ) লিঙ্গ, যৌন প্রবণতা, ধর্ম, জাতি, বয়স, জাতীয় উৎপত্তি, বা অক্ষমতার উপর ভিত্তি করে হয়রানি, অপব্যবহার, অপমান, ক্ষতি, বদনাম, অপবাদ, অসম্মান বা ভয় দেখানোর জন্য ব্যাবহার করা।</li>
                    <li>(চ) ভুল বা মিথ্যে তথ্য সরবরাহের জন্য।</li>
                    <li>(ছ) ভাইরাস কিংবা মালিশয়াস কোড আপলোড করা যা সাইটের স্বাভাবিক কার্যক্ষমতায় ব্যাঘাত ঘটাবে এবং যার জন্য অন্যরা ক্ষতিগ্রস্ত হবে এমন কাজে ব্যাবহার করা।</li>
                    <li>(জ) অন্যদের পার্সোনাল ইনফরমেশন বের করার জন্য ব্যাবহার করা।</li>
                    <li>(ঝ) স্প্যাম, ফিশ, ফার্ম, প্রিটেক্সট, স্পাইডার, ক্রল, বা স্ক্র্যাপ এর মত নিষিদ্ধ কাজে ব্যাবহার করার জন্য।</li>
                    <li>(ঞ) কোন অশ্লীল বা অনৈতিক উদ্দেশ্যে ব্যাবহার করলে।</li>
                    <li>(চ) সার্ভিস বা ওয়েবসাইট সংশ্লিষ্ট অথবা ইন্টারনেট সিকিউরিটি বৈশিষ্টে হস্তক্ষেপ করা বা বাধা দেওয়া।</li>
                </ul>
                <br />
                <p className="text-[15px]">এই নিষিদ্ধ কাজগুলো করার কারনে আমরা আপনার সার্ভিস ইউজেস কিংবা একাউন্ট টার্মিনেট করার অধিকার রাখি।</p>
            </Container>
        </Layout>
    );
};

export default PreOrder;

export const getServerSideProps: GetServerSideProps = async (ctx) => {
    //Urql
    const { client, ssrCache } = initUrqlClient();

    //Headers
    const fetchOptions = {
        headers: {
            cookie: ctx.req.headers.cookie as string
        }
    };

    //Queries
    //Common Queries
    await client.query(
        GET_SETTINGS, {}, {
        fetchOptions,
        requestPolicy: "network-only"
    }).toPromise();

    //--//
    await client.query(
        GET_RUNNING_FLASH, { searchInput: { page: 1, limit: 50 } }, {
        fetchOptions,
        requestPolicy: "network-only"
    }).toPromise();

    //---//
    await client.query(
        GET_PROFILE, {}, {
        fetchOptions,
        requestPolicy: "network-only"
    }).toPromise();

    //Props
    return { props: { urqlState: ssrCache?.extractData() } }
}